//1 1) Написать функцию, которая считает количество секунд в часе;

alert (60 * 60);
alert (60 ** 2);

//2) Переделайте приведенный код так, чтобы в нем использовались операции +=, -=, *=, /=, ++, --. Количество строк кода при этом не должно измениться. Код для переделки:

var num = 1
num += 12; //13
num -= 14; //-1
num *= 5; //-5
num /= 7;
num += 1;
num -= 1;

//3) Создайте переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'.
var str1 = 'Привет, ';
var str2 = 'Мир!'
alert (str1 + str2); 
